SOAP-WSC/ECS/MigrateETickets.xml

<!-- REQUEST -->

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                   xmlns:ecs="urn:ecs.wsapi.broadon.com">
<SOAP-ENV:Body>
<ecs:MigrateETickets xsi:type="ecs:MigrateETicketsRequestType">
  <ecs:Version>2.0</ecs:Version>
  <ecs:MessageId>ECSHOP-*-*</ecs:MessageId>
  <ecs:DeviceId>*</ecs:DeviceId>
  <ecs:DeviceToken>ST-*</ecs:DeviceToken>
  <ecs:AccountId>*</ecs:AccountId>
  <ecs:Region>*</ecs:Region>
  <ecs:Country>*</ecs:Country>
  <ecs:Language>*</ecs:Language>
  <ecs:SerialNo>*</ecs:SerialNo>
  <ecs:TargetDeviceId>*</ecs:TargetDeviceId>
  <ecs:TargetAccountId>*</ecs:TargetAccountId>
  <ecs:CheckOnly>false</ecs:CheckOnly> <!-- if true, doesn't return any error, even if something goes wrong server side -->
  <ecs:Mode>*</ecs:Mode> <!-- ??? -->
  <ecs:TitleIds>*</ecs:TitleIds>
</ecs:MigrateETickets>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>

<!-- RESPONSE -->
HTTP/1.1 200 OK

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <MigrateETicketsResponse xmlns="urn:ecs.wsapi.broadon.com">
            <Version>2.0</Version>
            <DeviceId>*</DeviceId>
            <MessageId>ECSHOP-*-*</MessageId>
            <TimeStamp>*</TimeStamp>
            <ErrorCode>0</ErrorCode>
            <ServiceStandbyMode>false</ServiceStandbyMode>
            <!-- appears however many times <ecs:TitleIds> appears -->
            <Transactions>
              <TransactionId>*</TransactionId>
              <Date>*</Date>
              <Type>XOUTTICKET</Type>
            </Transactions>
        </MigrateETicketsResponse>
    </soapenv:Body>
</soapenv:Envelope>
